Emacs.org
#+title: Emacs Configuration
#+property: header-args :mkdirp yes

* Preface

Welcome to the latest iteration of my Emacs configuration!  I'm not sure how many times I've rewritten my Emacs configuration over the years (it's probably less than you think), but I'm approaching this one with some specific goals and use cases in mind.

** Goals

I have specific goals for this configuration which I hope will serve some personal use cases and also inspire other people to experiment with their own ideas:

- The base configuration is *terminal-first*, meaning that everything I add there must provide a good experience for Emacs in the terminal.

- =init.el= itself should have no external package dependencies (if possible) and I should be able to drop it on any machine using =curl= and have a comfortable environment ready to go immediately.

- Additional functionality will be introduced using optional configuration modules which are only loaded on specific machines.

- Use built-in Emacs functionality as much as I can, only pull in community packages for critical workflows.

- Avoid special convenience key bindings; stay as close to "vanilla" as I can.

** Why?

This particular set of goals may seem surprising, so I'd like to provide some rationale.  I'm not attempting this because I think it's somehow better to be minimalistic.  I am trying to address specific use cases that I have instead of trying to come up with a generic configuration structure.  What I do here may not be right for you!

I've described in a few previous live streams how I feel that it's important I understand fundamental Emacs functionality and key bindings so that I can teach them effectively.  I really want to give the best advice to someone on what options they have available for their workflow and I can't do that if I don't understand the tools that Emacs provides by default.

Also, I think there is some value in writing your own Emacs Lisp code for certain things that may be provided by community packages.  Why depend on a small package with configuration options to suit many users when you could just write something similar for yourself that is tailored specifically to your needs?

There is probably more to say here that I haven't thought of yet; please feel free to ask me any questions you have on IRC, the [[https://forum.systemcrafters.net][forum]], or via email (my first name at systemcrafters.net).

** Built-in vs Community Packages

A short list of features I'm trying to stick with this time before reaching for community packages:

- Use =icomplete-vertical-mode= or =fido-vertical-mode= instead of Vertico.  Vertico is amazing, but I want to know what the actual pain points of the built-in solutions are before I resort to using something that is not built in.

- Get used to the built-in =completion-styles= before I try pulling in =orderless=.  =orderless= is excellent but I honestly have not experimented enough with the built-in styles to see if I can get around well enough with them.

- Use =vc-mode= instead of Magit as long as I can.  =vc-mode= is nowhere near as polished as Magit, by any means.  However, I should be able to do many of the same operations I accomplish with Magit (aside from interactive rebase?).  I want to test the limits of =vc-mode= before I pull in Magit, and even then, I may only use Magit for specific tasks that =vc-mode= is not good at.

- Try to avoid using =consult= for as long as I can.  =consult-line= is pretty useful, but =isearch= is mostly fine and I haven't even tried to configure it to be nicer yet.  The one thing I *will* miss from =consult= is =consult-ripgrep=, but I need to see if there's a way to use =ripgrep= directly with Emacs' existing =grep= functionality.

- Try to avoid using "workspace" packages like =beframe= or =tabspaces=.  There must be other useful ways to manage buffers that don't require forcing per-project isolation.  There's already =C-x p b= (=project-switch-to-buffer=) that could take care of 80% of my needs.  I also haven't experimented enough with =ibuffer= for mass buffer management to clean up those that I don't need any more in my current session.

- No configuration helpers other than =use-package= since it's now built in with Emacs 30.  There are also new keymap macros like [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Keymaps.html#index-define_002dkeymap][define-keymap]] which remove the need for packages like =general.el=, etc.

** Back to Literate Configuration

You may have realized that I am back to using a literate Emacs configuration with Org Babel.  I've actually been planning to do this for a while but never got around to it until now.

I had a couple of reasons for abandoning my old literate configuration:

- Tangling config changes after syncing from my dotfiles can be a pain
- I wanted to treat my configuration as real code instead of code blocks in an Org
  file

After spending over a year with my Emacs config as plain =.el= files, I feel like I'm missing the convenience of one big file that contains everything in one place.  Sure, I can move around pretty quickly in my dotfiles repo using =C-x p f= (=project-find-file=), but half the time I forget which file some aspect of my Emacs config lives in.

Also, as many have noticed, the [[https://config.daviwil.com][website where I publish my configuration]] has been down for almost as long as I haven't been using a literate config due to DNS changes at SourceHut.  I've been thinking about how I can get a website back up for my config again and tried a few different options, but going back to literate just feels like the most appropriate solution for now.

Lastly, I think a literate config is superior because it enables one to write real prose to explain their configuration and the rationale for why they do things a certain way.  I wouldn't have bothered to write this many paragraphs as a comment in an Emacs Lisp file.  People can learn from reading about how you use Emacs, it's a benefit to the community!

* Installation

To set up this configuration on a new machine, there are two options:

- Download =emacs/init.el= into your home folder as =.emacs=
- *OR* Clone the whole =dotfiles= repo to =~/.dotfiles= and run the following commands:

#+begin_src sh

  mkdir ~/emacs.d
  ln -sf ~/.dotfiles/emacs/init.el ~/.emacs.d/

#+end_src

We don't actually symlink the whole =~/.dotfiles/emacs= folder to =~/.emacs.d= to prevent Emacs from dumping runtime files and ELPA packages into the dotfiles repository!

* =init.el=

The standard =init.el= file is shared between all machines that use this configuration.  It is intended that file can be copied directly onto a new machine to get a convenient working environment up and running quickly.

Additional functionality is loaded from module files which are defined in sections later in this document.

I've structured all of this in a very concise way because much of it doesn't need explanation if you've been using Emacs for a while.

** Base Configuration

#+begin_src emacs-lisp :tangle emacs/init.el

  ;; -*- lexical-binding: t; -*-

  ;;; This file is generated from the Emacs.org file in my dotfiles repository!

  ;;; ----- Basic Configuration -----

  ;; Core settings
  (setq ;; Flash the UI instead of beeping
        visible-bell t

        ;; Yes, this is Emacs
        inhibit-startup-message t

        ;; Instruct auto-save-mode to save to the current file, not a backup file
        auto-save-default nil

        ;; No backup files, please
        make-backup-files nil

        ;; Make it easy to cycle through previous items in the mark ring
        set-mark-command-repeat-pop t

        ;; Don't warn on large files
        large-file-warning-threshold nil

        ;; Follow symlinks to VC-controlled files without warning
        vc-follow-symlinks t

        ;; Don't warn on advice
        ad-redefinition-action 'accept

        ;; Revert Dired and other buffers
        global-auto-revert-non-file-buffers t

        ;; Silence compiler warnings as they can be pretty disruptive
        native-comp-async-report-warnings-errors nil)

  ;; Core modes
  (repeat-mode 1)                ;; Enable repeating key maps
  (menu-bar-mode 0)              ;; Hide the menu bar
  (tool-bar-mode 0)              ;; Hide the tool bar
  (savehist-mode 1)              ;; Save minibuffer history
  (scroll-bar-mode 0)            ;; Hide the scroll bar
  (xterm-mouse-mode 1)           ;; Enable mouse events in terminal Emacs
  (display-time-mode 1)          ;; Display time in mode line / tab bar
  (fido-vertical-mode 1)         ;; Improved vertical minibuffer completions
  (column-number-mode 1)         ;; Show column number on mode line
  (tab-bar-history-mode 1)       ;; Remember previous tab window configurations
  (auto-save-visited-mode 1)     ;; Auto-save files at an interval
  (global-visual-line-mode 1)    ;; Visually wrap long lines in all buffers
  (global-auto-revert-mode 1)    ;; Refresh buffers with changed local files

  ;; Tabs to spaces
  (setq-default indent-tabs-mode nil
  	            tab-width 2)

  ;; Display line numbers in programming modes
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)

  ;; Make icomplete slightly more convenient
  (keymap-set icomplete-fido-mode-map "M-h" 'icomplete-fido-backward-updir)
  (keymap-set icomplete-fido-mode-map "TAB" 'icomplete-force-complete)

  ;; Delete trailing whitespace before saving buffers
  (add-hook 'before-save-hook 'delete-trailing-whitespace)

  ;; Move customization settings out of init.el
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file t))

  ;; Match completion substrings that may be out of order
  (defun dw/override-fido-completion-styles ()
    (setq-local completion-styles '(substring partial-completion emacs22)))

  (add-hook 'icomplete-minibuffer-setup-hook 'dw/override-fido-completion-styles)

#+end_src

** System Identification

I often need to modify behavior based on the type of system Emacs is running on, especially if it's running on Guix.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- System Identification -----

  (defvar dw/is-termux
    (string-suffix-p "Android" (string-trim (shell-command-to-string "uname -a"))))

  (defvar dw/current-distro (or (and (eq system-type 'gnu/linux)
                                     (file-exists-p "/etc/os-release")
                                     (with-temp-buffer
                                       (insert-file-contents "/etc/os-release")
                                       (search-forward-regexp "^ID=\"?\\(.*\\)\"?$")
                                       (intern (or (match-string 1)
                                                   "unknown"))))
                                'unknown))

  (defvar dw/is-guix-system (eql dw/current-distro 'guix))

#+end_src

** Package Management

Customize package management based on the type of system Emacs is running on.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- Package Management -----

  ;; Automatically install packages (when not on Guix) but don't load
  ;; them until requested
  (setq use-package-always-ensure (not dw/is-guix-system)
        use-package-always-defer t)

#+end_src

** Configuration Management

This section is currently under development as I figure out the best pattern to use for providing customization "knobs" on the base configuration.

For now, the idea is that I provide variables and functions that can be called in machine-specific configuration files (named with the =system-name=) to customize basic configuration details and load extension modules that are needed for each machine.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- Configuration Management -----

  (defvar dw/use-config-modules '()
    "A list of module symbols to load once init.el is finished.")

  (defvar dw/common-config-modules '(dw-auth
                                     dw-irc
                                     dw-present
                                     dw-0x0
                                     dw-writing
                                     dw-workflow)
    "Configuration modules most commonly used across my machines.")

  ;; Add configuration modules to load path
  (add-to-list 'load-path '"~/.dotfiles/emacs/modules")

  ;; Load system-specific configuration
  (let ((config-path
         (format "~/.dotfiles/emacs/systems/%s.el" system-name)))
    (if (file-exists-p config-path)
        (load-file config-path)
      (message "No per-system configuration found for %s!" system-name)))

#+end_src

** Appearance

I prefer to use terminals that support the full range of colors so that themes like =ef-themes= can have an equivalent appearance to graphical Emacs.

However, setting a background color in an Emacs theme generally defeats any transparency settings of the terminals I've used so I've added the =dw/clear-background-color= function to clear the background color after a theme gets applied.

I may switch to using a highly-customized =modus-vivendi= here if I can figure out the right combination of colors to approximate the usual =doom-palenight= theme that I use on System Crafters videos and streams.

#+begin_src emacs-lisp :tangle emacs/init.el

  ;;; ----- Appearance -----

  (defun dw/set-terminal-title (title)
    (send-string-to-terminal (format "\e]0;%s\a" title)))

  (defun dw/clear-background-color (&optional frame)
    (interactive)
    (or frame (setq frame (selected-frame)))
    "unsets the background color in terminal mode"
    (unless (display-graphic-p frame)
      ;; Set the terminal to a transparent version of the background color
      (send-string-to-terminal
       (format "\033]11;[90]%s\033\\"
           (face-attribute 'default :background)))
      (set-face-background 'default "unspecified-bg" frame)))

  ;; Clear the background color for transparent terminals
  (unless (display-graphic-p)
    (add-hook 'after-make-frame-functions 'dw/clear-background-color)
    (add-hook 'window-setup-hook 'dw/clear-background-color)
    (add-hook 'ef-themes-post-load-hook 'dw/clear-background-color))

  (use-package modus-themes
    :ensure nil
    :custom
    (modus-themes-italic-constructs t)
    (modus-themes-bold-constructs t)
    (modus-themes-common-palette-overrides
        `((bg-mode-line-active bg-lavender)
          (fg-mode-line-active fg-main)
          (border-mode-line-active bg-magenta-warmer)))
    :init
    (load-theme 'modus-vivendi-tinted t)
    (add-hook 'modus-themes-after-load-theme-hook #'dw/clear-background-color))

  ;; Make vertical window separators look nicer in terminal Emacs
  (set-display-table-slot standard-display-table 'vertical-border (make-glyph-code ?│))

  ;; Clean up the mode line
  (setq-default mode-line-format
                '("%e" "  "
                  (:propertize
                   ("" mode-line-mule-info mode-line-client mode-line-modified mode-line-remote))
                  mode-line-frame-identification
                  mode-line-buffer-identification
                  "   "
                  mode-line-position
                  mode-line-format-right-align
                  "  "
                  (project-mode-line project-mode-line-format)
                  " "
                  (vc-mode vc-mode)
                  "  "
                  mode-line-modes
                  mode-line-misc-info
                  "  ")
                project-mode-line t
                mode-line-buffer-identification '(" %b")
                mode-line-position-column-line-format '(" %l:%c"))

#+end_src

