Emacs.org
** =dw-workflow= - Workflow, Task, and Project Management

#+begin_src emacs-lisp :tangle emacs/modules/dw-workflow.el

  ;; -*- lexical-binding: t; -*-

  ;;; ----- TODO Configuration -----

  (setq org-todo-keywords
        '((sequence "TODO(t)" "WAIT(w)" "|" "DONE(d!)")))

  (setq org-todo-keyword-faces
        '(("GOAL" . (:foreground "orange red" :weight bold))
          ("WAIT" . (:foreground "HotPink2" :weight bold))
          ("BACK" . (:foreground "MediumPurple3" :weight bold))))

  ;;; ----- Context Tags -----

  (setq-default org-tag-alist
                '((:startgroup)
                  ("Areas")
                  (:grouptags)
                  ("@home" . ?H)
                  ("@work" . ?W)
                  (:endgroup)

                  (:startgrouptag . nil)
                  ("Contexts")
                  (:grouptags)
                  ("@computer" . ?C)
                  ("@mobile" . ?M)
                  ("@calls" . ?A)
                  ("@errands" . ?E)
                  (:endgrouptag)

                  ;; Task Types
                  (:startgrouptag . nil)
                  ("Types")
                  (:grouptags)
                  ("@easy" . ?e)
                  ("@hacking" . ?h)
                  ("@writing" . ?w)
                  ("@creative" . ?v)
                  ("@accounting" . ?a)
                  ("@email" . ?m)
                  ("@system" . ?s)
                  (:endgrouptag)

                  ;; Workflow states
                  (:startgroup . nil)
                  ("States")
                  (:grouptags)
                  ("@plan" . ?p)
                  ("@review" . ?r)
                  ("@followup" . ?f)
                  (:endgroup)))


  ;; Only make context tags inheritable (what about noexport?)
  (setq org-use-tag-inheritance "^@")

  ;;; ----- Time Tracking -----

  ;; Clock in on the current task when setting a timer
  (add-hook 'org-timer-set-hook #'org-clock-in)

  ;; Clock out of the current task when the timer is complete
  (add-hook 'org-timer-done-hook #'org-clock-out)

  ;;; ----- Agenda Configuration -----

  (defvar dw/base-agenda-files '("Inbox.org" "Schedule.org")
    "The base agenda files that will always be included.")

  (setq org-agenda-span 'day
        org-agenda-start-with-log-mode t
        org-agenda-files dw/base-agenda-files
        org-agenda-window-setup 'current-window)

  ;; Make done tasks show up in the agenda log
  (setq org-log-done 'time
        org-log-into-drawer t)

  ;;; ----- Denote Integration -----

  (defun dw/refresh-agenda-files ()
    (interactive)
    (setq org-agenda-files
          (append (denote-directory-files "_pra")
                  dw/base-agenda-files)))

  (defun dw/goto-weekly-note ()
    (interactive)
    (let* ((note-title (format-time-string "%Y-W%V"))
           (existing-notes
            (denote-directory-files (format "-%s" note-title) nil t)))
      (if existing-notes
          (find-file (car existing-notes))
        (denote note-title '("plw")))))

  (with-eval-after-load 'denote
    ;; Quick access commands
    (keymap-set global-map "C-c n w" #'dw/goto-weekly-note)

    ;; Refresh agenda files the first time
    (dw/refresh-agenda-files)

    ;; Update agenda files after notes are created or renamed
    (add-hook 'denote-after-rename-file-hook #'dw/refresh-agenda-files)
    (add-hook 'denote-after-new-note-hook #'dw/refresh-agenda-files))

  (provide 'dw-workflow)

#+end_src

** =dw-present= - Presentations and Live Streaming

I'm planning to develop a new presentation configuration using Prot's Logos package because it's a bit more flexible and will enable me to treat code files as presentations in addition to Org files and pretty much any other type of file that has syntax that can be interpreted as a page marker (like a comment string).

#+begin_src emacs-lisp :tangle emacs/modules/dw-present.el

  ;; -*- lexical-binding: t; -*-

  (defun dw/present-prepare-slide ()
    (when (and logos-focus-mode
               (derived-mode-p 'org-mode))
      (org-overview)
      (org-show-entry)
      (org-show-children)))

  (defun dw/present-toggle ()
    "Configures the buffer for a presentation."
    (interactive)
    (if logos-focus-mode
        (progn
          (setq-local face-remapping-alist nil)
          (widen)
          (logos-focus-mode 0))

      (setq-local face-remapping-alist '((default (:height 1.5) default)
                                         (org-document-title (:height 1.75) org-document-title)
                                         (org-block-begin-line (:height 0.7) org-block)))

      ;; Narrow the buffer and start focus mode
      (logos-narrow-dwim)
      (logos-focus-mode 1)

      ;; Prepare the slide
      (dw/present-prepare-slide)))

  (use-package logos
    :bind (([remap narrow-to-region] . logos-narrow-dwim)
  	       ([remap forward-page] . logos-forward-page-dwim)
           ([remap backward-page] . logos-backward-page-dwim))
    :custom
    (logos-outlines-are-pages t)
    (logos-scroll-lock t)
    :config
    (setf (alist-get 'org-mode logos-outline-regexp-alist) "^\\*\\{1,2\\} +")
    (add-hook 'logos-page-motion-hook #'dw/present-prepare-slide))

  (provide 'dw-present)

#+end_src

** =dw-irc= - IRC Configuration

I prefer =rcirc= as my default IRC client, it's simple and gets the job done.  Right now I'm using the hosted Soju bouncer on =chat.sr.ht= but hopefully I'll move to something self-hosted soon.

#+begin_src emacs-lisp :tangle emacs/modules/dw-irc.el

  ;; -*- lexical-binding: t; -*-

  (use-package rcirc
    :ensure nil
    :custom
    (rcirc-default-nick "daviwil")
    (rcirc-default-user-name "daviwil")
    (rcirc-default-full-name "David Wilson")
    (rcirc-server-alist `(("chat.sr.ht"
                           :port 6697
                           :encryption tls
                           :user-name "daviwil/irc.libera.chat@emacs")))

    (rcirc-reconnect-delay 5)
    (rcirc-fill-column 90)
    (rcirc-track-ignore-server-buffer-flag t)

    :config
    ;; Annoy me, please
    (rcirc-track-minor-mode 1)

    ;; See: https://idiomdrottning.org/rcirc-soju
    (defun-rcirc-command detach (channel)
      "Detach channel to soju."
      (interactive "sPart channel: ")
      (let ((channel (if (> (length channel) 0) channel target)))
        (rcirc-send-privmsg
         process "BouncerServ"
         (format
          "channel update %s -detached true -reattach-on highlight" channel)))))

  (provide 'dw-irc)

#+end_src

** =dw-0x0= - Share Text and Files with 0x0.st

The =0x0.el= package is really useful and I used it for a long time.  However, it's currently only on MELPA and I really only use a couple of the functions it provides.

Here's my own minimal implementation from scratch, please feel free to copy into your own config!

#+begin_src emacs-lisp :tangle emacs/modules/dw-0x0.el

  ;; -*- lexical-binding: t; -*-

  (defun dw/0x0-upload-text ()
    (interactive)
    (let* ((contents (if (use-region-p)
  		       (buffer-substring-no-properties (region-beginning) (region-end))
  		     (buffer-string)))
  	 (temp-file (make-temp-file "0x0" nil ".txt" contents)))
      (message "Sending %s to 0x0.st..." temp-file)
      (let ((url (string-trim-right
  		(shell-command-to-string
  		 (format "curl -s -F'file=@%s' https://0x0.st" temp-file)))))
        (message "The URL is %s" url)
        (kill-new url)
        (delete-file temp-file))))

  (defun dw/0x0-upload-file (file-path)
    (interactive "fSelect a file to upload: ")
    (message "Sending %s to 0x0.st..." file-path)
    (let ((url (string-trim-right
  	      (shell-command-to-string
  	       (format "curl -s -F'file=@%s' https://0x0.st" (expand-file-name file-path))))))
      (message "The URL is %s" url)
      (kill-new url)))

  (provide 'dw-0x0)

#+end_src

** =dw-desktop= - Desktop Environment Utilities

When used as part of a desktop environment, here are some packages that will make it easier for Emacs to drive most of the experience.

#+begin_src emacs-lisp :tangle emacs/modules/dw-desktop.el

  ;; -*- lexical-binding: t; -*-

  ;; Integrate with the system clipboard
  (unless (display-graphic-p)
    (use-package xclip
      :demand t
      :config
      (xclip-mode 1)))

  (use-package bluetooth)

  ;; Control NetworkManager via nmcli
  (use-package nm
    :vc (:url "https://github.com/Kodkollektivet/emacs-nm"
         :rev :newest))

  (provide 'dw-desktop)

#+end_src

** =dw-auth= - Authentication Utilities

I use GPG primarily when authenticating with Git remotes or opening =pass= entries.  =pinentry= is the tool that enables me to prompt for my GPG passphrase inside of Emacs.

=auth-source-pass= enables the use of =pass= entries for automatically loading credentials for certain things like my IRC bouncer password.

#+begin_src emacs-lisp :tangle emacs/modules/dw-auth.el

  ;; -*- lexical-binding: t; -*-

  ;; Use `pass` as an auth-source
  (when (file-exists-p "~/.password-store")
    (auth-source-pass-enable))

  ;; Enable GPG passphrase entry
  (use-package pinentry
    :demand t
    :config
    (pinentry-start))

  (provide 'dw-auth)

#+end_src

* Machine-Specific Settings

This section contains settings that are specific to various systems, particularly to choose extension modules to be loaded on top of the base configuration.

** phantom

#+begin_src emacs-lisp :tangle emacs/systems/phantom.el

  (setq dw/use-config-modules
        (append dw/common-config-modules
                '(dw-desktop)))

#+end_src

** daviwil-x1e

#+begin_src emacs-lisp :tangle emacs/systems/daviwil-x1e.el

  (setq dw/use-config-modules dw/common-config-modules)
  (setq xclip-method 'powershell)

#+end_src
